perf-tests/reports/load-100vu-pool150.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: perf-tests/k6/scenario.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m15s max duration (incl. graceful stop):
              * default: 100 looping VUs for 45s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 100 VUs  00.1s/45s

running (0m02.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 100 VUs  01.1s/45s

running (0m03.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 100 VUs  02.1s/45s

running (0m04.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  03.1s/45s

running (0m05.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   9% ] 100 VUs  04.1s/45s

running (0m06.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  11% ] 100 VUs  05.1s/45s

running (0m07.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  06.1s/45s

running (0m08.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  16% ] 100 VUs  07.1s/45s

running (0m09.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  08.1s/45s

running (0m10.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  09.1s/45s

running (0m11.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  22% ] 100 VUs  10.1s/45s

running (0m12.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  25% ] 100 VUs  11.1s/45s

running (0m13.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  12.1s/45s

running (0m14.0s), 100/100 VUs, 21 complete and 0 interrupted iterations
default   [  29% ] 100 VUs  13.1s/45s

running (0m15.0s), 100/100 VUs, 81 complete and 0 interrupted iterations
default   [  31% ] 100 VUs  14.1s/45s

running (0m16.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  15.1s/45s

running (0m17.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [  36% ] 100 VUs  16.1s/45s

running (0m18.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  17.1s/45s

running (0m19.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  18.1s/45s

running (0m20.0s), 100/100 VUs, 101 complete and 0 interrupted iterations
default   [  42% ] 100 VUs  19.1s/45s

running (0m21.0s), 100/100 VUs, 110 complete and 0 interrupted iterations
default   [  45% ] 100 VUs  20.1s/45s

running (0m22.0s), 100/100 VUs, 124 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  21.1s/45s

running (0m23.0s), 100/100 VUs, 160 complete and 0 interrupted iterations
default   [  49% ] 100 VUs  22.1s/45s

running (0m24.0s), 100/100 VUs, 200 complete and 0 interrupted iterations
default   [  51% ] 100 VUs  23.1s/45s

running (0m25.0s), 100/100 VUs, 200 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  24.1s/45s

running (0m26.0s), 100/100 VUs, 200 complete and 0 interrupted iterations
default   [  56% ] 100 VUs  25.1s/45s

running (0m27.0s), 100/100 VUs, 206 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  26.1s/45s

running (0m28.0s), 100/100 VUs, 220 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  27.1s/45s

running (0m29.0s), 100/100 VUs, 226 complete and 0 interrupted iterations
default   [  62% ] 100 VUs  28.1s/45s

running (0m30.0s), 100/100 VUs, 264 complete and 0 interrupted iterations
default   [  65% ] 100 VUs  29.1s/45s

running (0m31.0s), 100/100 VUs, 300 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  30.1s/45s

running (0m32.0s), 100/100 VUs, 300 complete and 0 interrupted iterations
default   [  69% ] 100 VUs  31.1s/45s

running (0m33.0s), 100/100 VUs, 306 complete and 0 interrupted iterations
default   [  71% ] 100 VUs  32.1s/45s

running (0m34.0s), 100/100 VUs, 315 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  33.1s/45s

running (0m35.0s), 100/100 VUs, 324 complete and 0 interrupted iterations
default   [  76% ] 100 VUs  34.1s/45s

running (0m36.0s), 100/100 VUs, 336 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  35.1s/45s

running (0m37.0s), 100/100 VUs, 374 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  36.1s/45s

running (0m38.0s), 100/100 VUs, 382 complete and 0 interrupted iterations
default   [  82% ] 100 VUs  37.1s/45s

running (0m39.0s), 100/100 VUs, 403 complete and 0 interrupted iterations
default   [  85% ] 100 VUs  38.1s/45s

running (0m40.0s), 100/100 VUs, 413 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  39.1s/45s

running (0m41.0s), 100/100 VUs, 424 complete and 0 interrupted iterations
default   [  89% ] 100 VUs  40.1s/45s

running (0m42.0s), 100/100 VUs, 431 complete and 0 interrupted iterations
default   [  91% ] 100 VUs  41.1s/45s

running (0m43.0s), 100/100 VUs, 445 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  42.1s/45s

running (0m44.0s), 100/100 VUs, 462 complete and 0 interrupted iterations
default   [  96% ] 100 VUs  43.1s/45s

running (0m45.0s), 100/100 VUs, 500 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  44.1s/45s

running (0m46.0s), 100/100 VUs, 509 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  45s

running (0m47.0s), 087/100 VUs, 522 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  45s

running (0m48.0s), 080/100 VUs, 529 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  45s

running (0m49.0s), 069/100 VUs, 540 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  45s

running (0m50.0s), 059/100 VUs, 550 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  45s

running (0m51.0s), 037/100 VUs, 572 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  45s


  █ THRESHOLDS 

    create_shipment_duration
    ✓ 'p(95)<1000' p(95)=46.169

    dashboard_duration
    ✗ 'p(95)<1000' p(95)=3071.8868

    http_req_duration
    ✗ 'p(95)<1000' p(95)=2.77s
    ✗ 'p(99)<2000' p(99)=4.19s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    login_duration
    ✗ 'p(95)<1000' p(95)=4348.185

    search_duration
    ✓ 'p(95)<1000' p(95)=646.9144


  █ TOTAL RESULTS 

    checks_total.......: 3755    72.305739/s
    checks_succeeded...: 100.00% 3755 out of 3755
    checks_failed......: 0.00%   0 out of 3755

    ✓ login 200
    ✓ dashboard 200
    ✓ search 200
    ✓ open shipment 200
    ✓ track 200
    ✓ create shipment 201/200
    ✓ update shipment 200

    CUSTOM
    create_shipment_duration.......: avg=17.764228   min=7.252  med=12.544   max=112.248  p(90)=34.5532   p(95)=46.169   
    dashboard_duration.............: avg=1066.5372   min=78.875 med=741.91   max=3309.25  p(90)=2944.4648 p(95)=3071.8868
    login_duration.................: avg=4116.850822 min=737.87 med=4166.907 max=4354.565 p(90)=4342.723  p(95)=4348.185 
    search_duration................: avg=231.305051  min=35.285 med=154.632  max=1018.778 p(90)=594.8584  p(95)=646.9144 

    HTTP
    http_req_duration..............: avg=328.08ms    min=3ms    med=12.4ms   max=4.35s    p(90)=841.09ms  p(95)=2.77s    
      { expected_response:true }...: avg=328.08ms    min=3ms    med=12.4ms   max=4.35s    p(90)=841.09ms  p(95)=2.77s    
    http_req_failed................: 0.00%  0 out of 3759
    http_reqs......................: 3759   72.382762/s

    EXECUTION
    iteration_duration.............: avg=8.03s       min=6.14s  med=7s       max=14.11s   p(90)=13.32s    p(95)=13.97s   
    iterations.....................: 609    11.726816/s
    vus............................: 37     min=37        max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 17 MB  321 kB/s
    data_sent......................: 3.3 MB 63 kB/s



running (0m51.9s), 000/100 VUs, 609 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  45s
time="2026-08-17T13:44:09+05:30" level=error msg="thresholds on metrics 'dashboard_duration, http_req_duration, login_duration' have been crossed"